# https://judge.softuni.org/Contests/Compete/Index/2418#1

#! Да се напише програма, 
# TODO: 1. която чете n-на брой цели числа, въведени от потребителя,

a = int(input()) # а-на брой. взима инпут, вкарва го в range()-на for loop-ът

# 'складиращи променливи'
b = 0 
c = 0

for i in range(a):
    x = int(input())

# TODO: 2. и проверява дали сред тях съществува число, което е равно на сумата на всички останали.
    
    b += x # сборът на всички инпути
    if x >= c:
        c = x # най-голямото число

# TODO: Ако числото е равно на останалите, то: "Yes" и на нов ред "Sum = "  + неговата стойност

if c == b-c: # най-голямо число == сборът на всички инпути - най-голямото число
    
    print(f'Yes\nSum = {c}')
#! \n -- newline 
# TODO: Aко не: "No" и на нов ред "Diff = " + разликата между най-големия елемент и сумата на останалите (по абсолютна стойност)

else:
    print(f'No\nDiff = {abs(c - (b-c))}') # The abs() function returns the absolute value of the specified number
