a = int(input())  #! бр. товари
m = 0  #! пари
A = 0  #! микробус 
B = 0  #! камион
C = 0  #! влак
X = 0
Z = 0
V = 0
e = 0
E = 0
for i in range(a):
    b = int(input())  #! тонаж

    if b <= 3:  # +200 лв/т - микробус
        m += b * 200
        A += b
        X += 1

    elif b >= 4 and b <= 11:  # +175 лв/т - камион
        m += b * 175
        B += b
        Z += 1

    elif b >= 12:  # +120 лв/т - влак
        m += b * 120
        C += b
        V += 1

e += A + B + C
E += m / e   #! средна цена на тон превозен товар
F = X+Z+V 
G = A / e * 100  #! процент превоз с микробус
H = B / e * 100 #! процент превоз с камион
O = C / e * 100  # процент превоз с влак

print(f"{E:.2f}")
print(f"{G:.2f}%")
print(f"{H:.2f}%")
print(f"{O:.2f}%")
