a = int(input())  #! капацитет на стадион
b = int(input())  #! броят на всички фенове

f = 0  #! фенове в А 
g = 0  #! фенове в B
h = 0  #! фенове в V
l = 0  #! фенове в G

A = 0
B = 0 
V = 0
G = 0
H = 0

for i in range(1, b + 1):
    c = str(input())
    if c == 'A':
        f += 1
    if c == 'B':
        g += 1
    if c == 'V':
        h += 1
    if c == 'G':
        l += 1

j = f + g + h + l  #! общ брой на феновете
A = f / j * 100  #! % на феновете в A
B = g / j * 100  #! % на феновете в В
V = h / j * 100  #! % на феновете в V
G = l / j * 100  #! % на феновете в G
H = j / a * 100  #! % вс фенове/кап. на стад.

print(f"{A:.2f}%") 
print(f"{B:.2f}%") 
print(f"{V:.2f}%") 
print(f"{G:.2f}%") 
print(f"{H:.2f}%") 
